/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_atoi.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/15 13:18:24 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/25 15:18:14 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
ОПИСАНИЕ
Функция atoi() конвертирует начальную часть строки, на которую указывает str,
в целое число. Функция ведет себя так же, как strtol(nptr, (char **)NULL, 10);
за исключением того, что она не определяет ошибок. Строка должна начинаться с
пустых символов (определяемых при помощи isspace(3)), далее должен следовать
один знак: `+' или `-' (если есть).

ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ
Конвертированное значение.
*/

#include "libft.h"

int	ft_atoi(const char *str)
{
	int	res;
	int	neg;

	res = 0;
	neg = 1;
	while ((*str == ' ') || (*str == '\n') || (*str == '\t') \
			|| (*str == '\v') || (*str == '\f') || (*str == '\r'))
		str++;
	if (*str == '-' || *str == '+')
	{
		if (*str == '-')
			neg = -1;
		str++;
	}
	while (*str >= '0' && *str <= '9')
	{
		res = (res * 10) + (*str - '0');
		str++;
		if (res * neg > 0 && neg == -1)
			return (0);
		if (res * neg < 0 && neg == 1)
			return (-1);
	}
	return (res * neg);
}
/*
#include <stdio.h>

int	main(void)
{
	char	*mas;

	mas = "  \t   \n  +42  jhgfd";
	printf("ft	: %d\n", ft_atoi(mas));
	printf("c	: %d\n", atoi(mas));
	return (0);
}
*/