/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_isalnum.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/15 17:35:49 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/15 17:36:05 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
ОПИСАНИЕ
Данные функции проверяют, попадает ли символ c (который должен иметь значение
unsigned char или EOF) в определенный класс символов, существующих в текущем
окружении.
Проверяет символ на принадлежность к текстовым символам; вызов эквивалентен
(isalpha(c) || isdigit(c)).

ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ
Возвращаются ненулевые значения, если проверяемый символ c попадает в
соответствующий класс символов, в противном случае возвращается ноль. 
*/

#include "libft.h"

int	ft_isalnum(int c)
{
	return (ft_isalpha(c) || ft_isdigit(c));
}
/*
#include <stdio.h>
#include <ctype.h>

int	main(void)
{
	int	n = 66;

	printf("ft	: %d\n", ft_isalnum(n));
	printf("c	: %d\n", isalnum(n));
	return (0);
}
*/