/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstdelone.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/27 12:44:39 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/27 13:44:14 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
№ 1. Элемент для освобождения.
#2. Адрес функции, используемой для удаления содержимого.

Внешние функции
free

Описание
Принимает в качестве параметра элемент и освобождает память содержимого
элемента, используя функцию 'del', заданную в качестве параметра,
и освобождает элемент. Память о 'next' не должна быть освобождена.
*/

#include "libft.h"

void	ft_lstdelone(t_list *lst, void (*del)(void*))
{
	del(lst->content);
	free(lst);
	lst = NULL;
}
