/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstmap.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/27 13:17:58 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/27 13:44:00 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
##1. Адрес указателя на элемент.
##2. Адрес функции, используемой для итерации по списку.
##3. Адрес функции, используемой для удаления содержимого элемента,
если это необходимо.

Возвращаемое значение
Новый список. Значение NULL, если выделение завершится неудачно.

Внешние факторы.
malloc, free

Описание
Повторяет список "lst" и применяет функцию "f" к содержимому каждого
элемента. Создает новый список, полученный в результате последовательных
применений функции "f". Функция "del" используется для удаления содержимого
элемента, если это необходимо.
*/

#include "libft.h"

t_list	*ft_lstmap(t_list *lst, void *(*f)(void *), void (*del)(void *))
{
	t_list	*new;
	t_list	*tmp;
	t_list	*begin;

	if (lst)
	{
		tmp = lst;
		begin = ft_lstnew(f(tmp->content));
		if (!begin)
			return (NULL);
		tmp = tmp->next;
		while (tmp)
		{
			new = ft_lstnew(f(tmp->content));
			if (!new)
			{
				ft_lstclear(&begin, del);
				return (NULL);
			}
			ft_lstadd_back(&begin, new);
			tmp = tmp->next;
		}
		return (begin);
	}
	return (NULL);
}
