/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstclear.c                                      :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jg <jg@student.42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/27 13:02:16 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/11/05 18:05:09 by jg               ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
№1. Адрес указателя на элемент.
#2. Адрес функции, используемой для удаления содержимого элемента.

Возвращаемое значение
None

Внешних функций.
free

Описание
Удаляет и освобождает данный элемент и всех его последователей,
используя функцию 'del' и free(3). Наконец, указатель на список
должен быть установлен в значение NULL
*/

#include "libft.h"

void	ft_lstclear(t_list **lst, void (*del)(void*))
{
	t_list	*tmp;

	if (lst)
	{
		while (*lst)
		{
			tmp = (*lst)->next;
			ft_lstdelone(*lst, del);
			(*lst) = tmp;
		}
	}
}
