/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lstiter.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/27 13:15:26 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/27 13:21:25 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
#1. Адрес указателя на элемент.
#2. Адрес функции, используемой для итерации по списку.

Возвращаемое значение
Никто

Внешние факторы.
Никто

Описание
Повторяет список "lst’ и применяет функцию "f" к содержимому каждого элемента.
*/

#include "libft.h"

void	ft_lstiter(t_list *lst, void (*f)(void *))
{
	while (lst)
	{
		f(lst->content);
		lst = lst->next;
	}
}
