/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_memcmp.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/15 17:39:39 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/15 17:39:45 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
ОПИСАНИЕ
Функция memcmp() сравнивает первые n байтов областей памяти s1 и s2.
Возвращается целое число, меньшее, большее нуля или равное ему,
если определено, что s1 меньше, больше, чем s2, или равно ему.

ВОЗВРАЩАЕМЫЕ ЗНАЧЕНИЯ
Функция memcmp() возвращает целое, меньшее, большее нуля или
равное ему, если определено, что первые n байтов s1 меньше,
больше, чем первые n байтов s2, или равны им.
*/
#include "libft.h"

int	ft_memcmp(const void *s1, const void *s2, size_t n)
{
	unsigned char	*ptr1;
	unsigned char	*ptr2;

	ptr1 = (unsigned char *)s1;
	ptr2 = (unsigned char *)s2;
	while (n--)
	{
		if (*ptr1 != *ptr2)
			return (*ptr1 - *ptr2);
		ptr1++;
		ptr2++;
	}
	return (0);
}
