/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putstr_fd.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/22 19:31:07 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/22 19:41:31 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
#1. Строка для вывода.
#2. Файловый дескриптор, на который нужно писать.

Возвращаемое значение
Никто

Внешние факторы.
write

Описание
Выводит строку 's' в указанный файловый дескриптор.
*/

#include "libft.h"

void	ft_putstr_fd(char *s, int fd)
{
	int	i;

	if (s == NULL)
		return ;
	i = 0;
	while (s[i] != '\0')
		i++;
	write(fd, s, i);
}
/*
int	main(void)
{
	int		fd;
	char	*str;

	fd = 1;
	str = "Hello World!";
	ft_putstr_fd(str, fd);
	return (0);
}
*/