/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putendl_fd.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fdarkhaw <fdarkhaw@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/22 19:47:39 by fdarkhaw          #+#    #+#             */
/*   Updated: 2021/10/22 20:31:00 by fdarkhaw         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Параметры
#1. Строка для вывода.
#2. Файловый дескриптор, на который нужно писать.

Возвращаемое значение
Никто

Внешние факторы.
write

Описание
Выводит строку 's' в указанный файловый дескриптор,
за которой следует новая строка.
*/

#include "libft.h"

void	ft_putendl_fd(char *s, int fd)
{
	int		i;

	if (s == NULL)
		return ;
	i = 0;
	while (s[i] != '\0')
		i++;
	write(fd, s, i);
	write(fd, "\n", 1);
}
/*
int	main(void)
{
	int		fd;
	char	*str;

	fd = 1;
	str = "Hello World!";
	ft_putendl_fd(str, fd);
	return (0);
}
*/